интмаг/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиент</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

интмаг/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

интмаг/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

интмаг/src/Enums/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказов</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Подтвержден</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

интмаг/src/Documents/ЗаказКлиента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ)
    Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаказов.Подтвержден Тогда
        // Инициализация движений
        Движения.ОстаткиТоваров.Записывать = Истина;
        Движения.Продажи.Записывать = Истина;
        
        Для Каждого Строка Из Товары Цикл
            // Контроль остатков
            Отбор = Новый Структура();
            Отбор.Вставить("Номенклатура", Строка.Номенклатура);
            Отбор.Вставить("Склад", ЭтотОбъект.Склад);
            
            Остатки = РегистрыНакопления.ОстаткиТоваров.Остатки(ЭтотОбъект.Дата, Отбор);
            
            Если Остатки.Количество() = 0 Тогда
                Отказ = Истина;
                Сообщить("Недостаточно товара: " + Строка.Номенклатура);
                Возврат;
            КонецЕсли;
            
            Остаток = Остатки[0].Количество;
            
            Если Остаток < Строка.Количество Тогда
                Отказ = Истина;
                Сообщить("Недостаточно товара: " + Строка.Номенклатура + ". В наличии: " + Остаток);
                Возврат;
            КонецЕсли;
            
            // Создаем движение по регистру остатков (расход)
            Движение = Движения.ОстаткиТоваров.Добавить();
            Движение.Период = ЭтотОбъект.Дата;
            Движение.Номенклатура = Строка.Номенклатура;
            Движение.Склад = ЭтотОбъект.Склад;
            Движение.Количество = -Строка.Количество; // Указываем отрицательное значение для расхода
            
            // Создаем движение по регистру продаж (приход)
            ДвижениеП = Движения.Продажи.Добавить();
            ДвижениеП.Период = ЭтотОбъект.Дата;
            ДвижениеП.Номенклатура = Строка.Номенклатура;
            ДвижениеП.Клиент = ЭтотОбъект.Клиент;
            ДвижениеП.Склад = ЭтотОбъект.Склад;
            ДвижениеП.Количество = Строка.Количество;
            ДвижениеП.Сумма = Строка.Сумма;
        КонецЦикла;
    КонецЕсли;
КонецПроцедуры
